src/CF/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/НастройкиПользователей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//sza140827-0034 взять основное значение
//sza140119-1433  
//sza131130-0059  
&НаКлиенте
Процедура ЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьТипЗначенияНастройки();
//	Элементы.ЗначениеНастройки.ОграничениеТипа = Запись.Настройка.ТипЗначения;
//  Запись.ЗначениеНастройки = Элементы.ЗначениеНастройки.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеНастройки);
//  Элементы.ЗначениеНастройки.ВыбиратьТип = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьТипЗначенияНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиПриИзменении(Элемент)
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сменил") + " " + Запись.Настройка, 2);
КонецПроцедуры

&НаСервере
Процедура ОчиститьТипЗначенияНастройки()
		
		ОсновноеЗначение = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты(ПланыВидовХарактеристик.НастройкиПользователей.ПолучитьИмяПредопределенного(Запись.Настройка), ИСТИНА);

    	Элементы.ЗначениеНастройки.ОграничениеТипа = Запись.Настройка.ТипЗначения;
    	Запись.ЗначениеНастройки = Элементы.ЗначениеНастройки.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеНастройки);
    	Элементы.ЗначениеНастройки.ВыбиратьТип = ЛОЖЬ;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Запись.ДатаУстановки = ТекущаяДата();	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Настройка) Тогда
		ОчиститьТипЗначенияНастройки();
	КонецЕсли;
	
	Элементы.ДатаУстановки.Видимость = ЗначениеЗаполнено(Запись.ДатаУстановки);

КонецПроцедуры

&НаКлиенте
Процедура ВзятьОсновноеЗначение(Команда)
	Запись.ЗначениеНастройки = ОсновноеЗначение;
КонецПроцедуры
